<?php

/**
 * ECSHOP 微信支付插件语言文件
 * ============================================================================
 * * 版权所有 2005-2012 上海商派网络科技有限公司，并保留所有权利。
 * 网站地址: http://www.ecshop.com；
 * ----------------------------------------------------------------------------
 * 这不是一个自由软件！您只能在不用于商业目的的前提下对程序代码进行修改和
 * 使用；不允许对程序代码以任何形式任何目的的再发布。
 * ============================================================================
 * $Author: Gavin $
 * $Id: wxpay.php 17217 2015-05-09 17:38:08Z Gavin $
 */

global $_LANG;

$_LANG['wxpay']            = '微信支付';
$_LANG['wxpay_desc']       = '微信支付是集成在微信客户端的支付功能，用户可以通过手机完成快速的支付流程。微信支付以绑定银行卡的快捷支付为基础，向用户提供安全、快捷、高效的支付服务。';
$_LANG['wxpay_account']    = '微信支付商户号';
$_LANG['wxpay_key']        = '微信支付密钥';
$_LANG['magic_string']     = '自定义签名';
$_LANG['pay_button']       = '立即使用微信支付';
$_LANG['account_voucher']  = '会员帐户充值';
$_LANG['shop_order_sn']    = '商城订单号';

$_LANG['wxpay_partner'] = '合作者身份ID';
$_LANG['pay_button'] = '立即使用支付宝支付';

$_LANG['wxpay_pay_method'] = '选择接口类型';
$_LANG['wxpay_pay_method_desc'] = '请选择您最后一次跟支付宝签订的协议里面说明的接口类型';
$_LANG['wxpay_pay_method_range'][0] = '使用标准双接口';
$_LANG['wxpay_pay_method_range'][1] = '使用担保交易接口';
$_LANG['wxpay_pay_method_range'][2] = '使用即时到帐交易接口';

?>